SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# SPM (writing flash from app)           #
#________________________________________#
avrdb.menu.appspm.no=Disabled (Always use this if not writing flash from app)
avrdb.menu.appspm.no.bootloader.appspm=
avrdb.menu.appspm.no.bootloader.BOOTSIZE=0x00
avrdb.menu.appspm.no.build.appspmabr=
avrdb.menu.appspm.full=Anywhere after 0x0200 (Warning: App allowed to overwrite itself)
avrdb.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1
avrdb.menu.appspm.full.build.appspmabr=.spmALL
avrdb.menu.appspm.16plus=Above 0x4000
avrdb.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=32
avrdb.menu.appspm.16plus.bootloader.CODESIZE=32
avrdb.menu.appspm.24plus=Above 0x6000
avrdb.menu.appspm.24plus.bootloader.appspm=-DSPM_FROM_APP=48
avrdb.menu.appspm.24plus.bootloader.CODESIZE=48
avrdb.menu.appspm.32plus=Above 0x8000 (AVR128/64 only, All mapped flash on AVR64 writable)
avrdb.menu.appspm.32plus.bootloader.appspm=-DSPM_FROM_APP=64
avrdb.menu.appspm.32plus.bootloader.CODESIZE=64
avrdb.menu.appspm.48plus=Above 0xC000 (AVR128/64 only)
avrdb.menu.appspm.48plus.bootloader.appspm=-DSPM_FROM_APP=96
avrdb.menu.appspm.48plus.bootloader.CODESIZE=96
avrdb.menu.appspm.56plus=Above 0xD000 (AVR128/64 only)
avrdb.menu.appspm.56plus.bootloader.appspm=-DSPM_FROM_APP=112
avrdb.menu.appspm.56plus.bootloader.CODESIZE=112
avrdb.menu.appspm.60plus=Above 0xE000 (AVR128/64 only)
avrdb.menu.appspm.60plus.bootloader.appspm=-DSPM_FROM_APP=120
avrdb.menu.appspm.60plus.bootloader.CODESIZE=120
avrdb.menu.appspm.64plus=Above 0x10000 (AVR128 only)
avrdb.menu.appspm.64plus.bootloader.appspm=-DSPM_FROM_APP=128
avrdb.menu.appspm.64plus.bootloader.CODESIZE=128
avrdb.menu.appspm.80plus=Above 0x14000 (AVR128 only)
avrdb.menu.appspm.80plus.bootloader.appspm=-DSPM_FROM_APP=160
avrdb.menu.appspm.80plus.bootloader.CODESIZE=160
avrdb.menu.appspm.96plus=Above 0x18000 (AVR128 only, where it allows write of all mapped flash)
avrdb.menu.appspm.96plus.bootloader.appspm=-DSPM_FROM_APP=192
avrdb.menu.appspm.96plus.bootloader.CODESIZE=192
avrdb.menu.appspm.112plus=Above 0x1C000 (AVR128 only)
avrdb.menu.appspm.112plus.bootloader.appspm=-DSPM_FROM_APP=224
avrdb.menu.appspm.112plus.bootloader.CODESIZE=224
avrdb.menu.appspm.120plus=Above 0x1E000
avrdb.menu.appspm.120plus.bootloader.appspm=-DSPM_FROM_APP=240
avrdb.menu.appspm.120plus.bootloader.CODESIZE=240

##########################################################################
#                                                                        #
###                 ###  #     # ####      ####  ####                  ###
#####              #   # #     # #   #     #   # #   #               #####
#######            #####  #   #  ####  ### #   # #   #             #######
#####              #   #   # #   # #       #   # #   #               #####
###                #   #    #    #  #      ####  ####                  ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for DD parts   #
#________________________________________#
avrdd.upload.tool=avrdude
avrdd.upload.prog_interlock=
avrdd.build.board=avrdd
avrdd.build.mvioenable=-DMVIO_ENABLED
avrdd.build.core=dxcore
avrdd.build.f_cpu={build.speed}000000L
avrdd.build.text_section_start=.text=0x0
avrdd.build.extra_flags= {bootloader.appspm} {build.mvioenable}
avrdd.build.export_merged_output=false
avrdd.build.highestcb=B2
avrdd.build.printf=
avrdd.build.attachmode=-DCORE_ATTACH_ALL

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrdd.bootloader.tool=avrdude
avrdd.bootloader.WDTCFG=0x00
avrdd.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrdd.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdd.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
avrdd.bootloader.CODESIZE=0x00
avrdd.bootloader.BOOTSIZE=0x01
avrdd.bootloader.avrdudestring=
avrdd.bootloader.pymcuprogstring=-aerase

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrdd.build.mcupostfix=
avrdd.build.printfabr=
avrdd.build.attachabr=
avrdd.build.wireabr=
avrdd.build.appspmabr=.spm{bootloader.CODESIZE}

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DD submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
# 14/20-pin parts get default millis     #
# changed just like tinyAVRs do          #
#________________________________________#
avrdd.menu.chip.avr64dd32=AVR64DD32
avrdd.menu.chip.avr64dd28=AVR64DD28
avrdd.menu.chip.avr64dd20=AVR64DD20
avrdd.menu.chip.avr64dd14=AVR64DD14
avrdd.menu.chip.avr32dd32=AVR32DD32
avrdd.menu.chip.avr32dd28=AVR32DD28
avrdd.menu.chip.avr32dd20=AVR32DD20
avrdd.menu.chip.avr32dd14=AVR32DD14
avrdd.menu.chip.avr16dd32=AVR16DD32
avrdd.menu.chip.avr16dd28=AVR16DD28
avrdd.menu.chip.avr16dd20=AVR16DD20
avrdd.menu.chip.avr16dd14=AVR16DD14
avrdd.menu.chip.avr64dd32.build.mcu=avr64dd32
avrdd.menu.chip.avr64dd32.upload.maximum_size=65536
avrdd.menu.chip.avr64dd32.upload.maximum_data_size=8192
avrdd.menu.chip.avr64dd32.build.variant=32pin-ddseries
avrdd.menu.chip.avr64dd20.build.highestcb=B2
avrdd.menu.chip.avr64dd28.build.mcu=avr64dd28
avrdd.menu.chip.avr64dd28.upload.maximum_size=65536
avrdd.menu.chip.avr64dd28.upload.maximum_data_size=8192
avrdd.menu.chip.avr64dd28.build.variant=28pin-ddseries
avrdd.menu.chip.avr64dd20.build.highestcb=B2
avrdd.menu.chip.avr64dd20.build.mcu=avr64dd20
avrdd.menu.chip.avr64dd20.upload.maximum_size=65536
avrdd.menu.chip.avr64dd20.upload.maximum_data_size=8192
avrdd.menu.chip.avr64dd20.build.highestcb=B1
avrdd.menu.chip.avr64dd20.build.variant=20pin-ddseries
avrdd.menu.chip.avr64dd14.build.mcu=avr64dd14
avrdd.menu.chip.avr64dd14.upload.maximum_size=65536
avrdd.menu.chip.avr64dd14.upload.maximum_data_size=8192
avrdd.menu.chip.avr64dd14.build.highestcb=B1
avrdd.menu.chip.avr64dd14.build.variant=14pin-ddseries
avrdd.menu.chip.avr32dd32.build.mcu=avr32dd32
avrdd.menu.chip.avr32dd32.upload.maximum_size=32768
avrdd.menu.chip.avr32dd32.upload.maximum_data_size=4096
avrdd.menu.chip.avr32dd32.build.variant=32pin-ddseries
avrdd.menu.chip.avr32dd28.build.mcu=avr32dd28
avrdd.menu.chip.avr32dd28.upload.maximum_size=32768
avrdd.menu.chip.avr32dd28.upload.maximum_data_size=4096
avrdd.menu.chip.avr32dd28.build.variant=28pin-ddseries
avrdd.menu.chip.avr32dd20.build.mcu=avr32dd20
avrdd.menu.chip.avr32dd20.upload.maximum_size=32768
avrdd.menu.chip.avr32dd20.upload.maximum_data_size=4096
avrdd.menu.chip.avr32dd20.build.highestcb=B1
avrdd.menu.chip.avr32dd20.build.variant=20pin-ddseries
avrdd.menu.chip.avr32dd14.build.mcu=avr32dd14
avrdd.menu.chip.avr32dd14.upload.maximum_size=32768
avrdd.menu.chip.avr32dd14.upload.maximum_data_size=4096
avrdd.menu.chip.avr32dd14.build.highestcb=B1
avrdd.menu.chip.avr32dd14.build.variant=14pin-ddseries
avrdd.menu.chip.avr16dd32.build.mcu=avr16dd32
avrdd.menu.chip.avr16dd32.upload.maximum_size=16384
avrdd.menu.chip.avr16dd32.upload.maximum_data_size=2048
avrdd.menu.chip.avr16dd32.build.variant=32pin-ddseries
avrdd.menu.chip.avr16dd28.build.mcu=avr16dd28
avrdd.menu.chip.avr16dd28.upload.maximum_size=16384
avrdd.menu.chip.avr16dd28.upload.maximum_data_size=2048
avrdd.menu.chip.avr16dd28.build.variant=28pin-ddseries
avrdd.menu.chip.avr16dd20.build.mcu=avr16dd20
avrdd.menu.chip.avr16dd20.upload.maximum_size=16384
avrdd.menu.chip.avr16dd20.upload.maximum_data_size=2048
avrdd.menu.chip.avr16dd20.build.highestcb=B1
avrdd.menu.chip.avr16dd20.build.variant=20pin-ddseries
avrdd.menu.chip.avr16dd14.build.mcu=avr16dd14
avrdd.menu.chip.avr16dd14.upload.maximum_size=16384
avrdd.menu.chip.avr16dd14.upload.maximum_data_size=2048
avrdd.menu.chip.avr16dd14.build.highestcb=B1
avrdd.menu.chip.avr16dd14.build.variant=14pin-ddseries

