SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Optiboot serial port                   #
#________________________________________#
avrdaopti.menu.bootloaderusart.ser0_alt=USART0 (alt): TX PA4, RX PA5
avrdaopti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrdaopti.menu.bootloaderusart.ser0_alt.bootloader.portname=Serial
avrdaopti.menu.bootloaderusart.ser0_alt.bootloader.portswap=1
avrdaopti.menu.bootloaderusart.ser0=USART0 (default pins): TX PA0, RX PA1 (int. clock only)
avrdaopti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrdaopti.menu.bootloaderusart.ser0.bootloader.portname=Serial
avrdaopti.menu.bootloaderusart.ser0.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser1=USART1: TX PC0, RX PC1
avrdaopti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrdaopti.menu.bootloaderusart.ser1.bootloader.portname=Serial1
avrdaopti.menu.bootloaderusart.ser1.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser1_alt=USART1 (alt): TX PC4, RX PC5 (48/64-pin only)
avrdaopti.menu.bootloaderusart.ser1_alt.bootloader.port=_ser1_alt
avrdaopti.menu.bootloaderusart.ser1_alt.bootloader.portname=Serial1
avrdaopti.menu.bootloaderusart.ser1_alt.bootloader.portswap=1
avrdaopti.menu.bootloaderusart.ser2=USART2: TX PF0, RX PF1
avrdaopti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrdaopti.menu.bootloaderusart.ser2.bootloader.portname=Serial2
avrdaopti.menu.bootloaderusart.ser2.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser2_alt=USART2 (alt): TX PF4, RX PF5 (32+-pin only)
avrdaopti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt
avrdaopti.menu.bootloaderusart.ser2_alt.bootloader.portname=Serial2
avrdaopti.menu.bootloaderusart.ser2_alt.bootloader.portswap=1
avrdaopti.menu.bootloaderusart.ser3=USART3: TX PB0, RX PB1 (48/64-pin only)
avrdaopti.menu.bootloaderusart.ser3.bootloader.port=_ser3
avrdaopti.menu.bootloaderusart.ser3.bootloader.portname=Serial3
avrdaopti.menu.bootloaderusart.ser3.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser3_alt=USART3 (alt): TX PB4, RX PB5 (48/64-pin only)
avrdaopti.menu.bootloaderusart.ser3_alt.bootloader.port=_ser3_alt
avrdaopti.menu.bootloaderusart.ser3_alt.bootloader.portname=Serial3
avrdaopti.menu.bootloaderusart.ser3_alt.bootloader.portswap=1
avrdaopti.menu.bootloaderusart.ser4=USART4: TX PE0, RX PE1 (48/64-pin only)
avrdaopti.menu.bootloaderusart.ser4.bootloader.port=_ser4
avrdaopti.menu.bootloaderusart.ser4.bootloader.portname=Serial4
avrdaopti.menu.bootloaderusart.ser4.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser4_alt=USART4 (alt): TX PE4, RX PE5 (64-pin only)
avrdaopti.menu.bootloaderusart.ser4_alt.bootloader.port=_ser4_alt
avrdaopti.menu.bootloaderusart.ser4_alt.bootloader.portname=Serial4
avrdaopti.menu.bootloaderusart.ser4_alt.bootloader.portswap=1
avrdaopti.menu.bootloaderusart.ser5=USART5: TX PG0, RX PG1 (64-pin only)
avrdaopti.menu.bootloaderusart.ser5.bootloader.port=_ser5
avrdaopti.menu.bootloaderusart.ser5.bootloader.portname=Serial5
avrdaopti.menu.bootloaderusart.ser5.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser5_alt=USART5 (alt): TX PG4, RX PG5 (64-pin only)
avrdaopti.menu.bootloaderusart.ser5_alt.bootloader.port=_ser5_alt
avrdaopti.menu.bootloaderusart.ser5_alt.bootloader.portname=Serial5
avrdaopti.menu.bootloaderusart.ser5_alt.bootloader.portswap=1



##########################################################################
#                                                                        #
#   ###  #     # ####      ####  ####            ###          #          #
#  #   # #     # #   #     #   # #   #          #   #        ###  ##     #
#  #####  #   #  ####  ### #   # ####           #   #  ###    #          #
#  #   #   # #   # #       #   # #   #          #   #  #  #   #   ##     #
#  #   #    #    #  #      ####  ####            ###   ###    #   ##     #
#______________________________________________________#_________________#
#                                        #             #
# Parameters and defaults for DB parts   #
#________________________________________#
avrdbopti.build.board=avrdb
avrdbopti.build.mvioenable=-DMVIO_ENABLED
avrdbopti.build.core=dxcore
avrdbopti.build.f_cpu={build.speed}000000L
avrdbopti.build.text_section_start=.text=0x200
avrdbopti.build.extra_flags= -DSERIAL_PORT_BOOT={bootloader.portname} -DSERIAL_PORT_BOOT_PORTMUX={bootloader.portswap} -DUSING_OPTIBOOT {build.mvioenable}
avrdbopti.build.export_merged_output=true
avrdbopti.build.printf=
avrdbopti.build.attachmode=-DCORE_ATTACH_ALL

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrdbopti.bootloader.tool=avrdude
avrdbopti.bootloader.defaultentrycond=_extrf
avrdbopti.bootloader.entrycond={bootloader.defaultentrycond}
avrdbopti.bootloader.file={runtime.platform.path}/bootloaders/hex/{bootloader.class}{bootloader.port}{bootloader.entrycond}.hex
avrdbopti.bootloader.WDTCFG=0x00
avrdbopti.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrdbopti.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
avrdbopti.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
avrdbopti.bootloader.CODESIZE=0x00
avrdbopti.bootloader.BOOTSIZE=0x01
avrdbopti.bootloader.avrdudestring=-Uflash:w:{bootloader.file}:i
avrdbopti.bootloader.pymcuprogstring=-f "{bootloader.file}" -a write

#----------------------------------------#
# Upload parameters for Optiboot         #
#________________________________________#
avrdbopti.upload.tool=avrdude
avrdbopti.upload.protocol=arduino
avrdbopti.upload.extra_params=-D
avrdbopti.upload.speed=115200
avrdbopti.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards as it is guaranteed run correctly"

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrdbopti.build.mcupostfix=opti
avrdbopti.build.printfabr=
avrdbopti.build.attachabr=
avrdbopti.build.wireabr=
avrdbopti.build.appspmabr=

