SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Optiboot serial port                   #
#________________________________________#
avrddopti.menu.bootloaderusart.ser0=USART0 (default pins): TX PA0, RX PA1 (int. clock only)
avrddopti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrddopti.menu.bootloaderusart.ser0.bootloader.portname=Serial
avrddopti.menu.bootloaderusart.ser0.bootloader.portswap=0
avrddopti.menu.bootloaderusart.ser0_alt1=USART0 (alt1): TX PA4, RX PA5 (20+ pin only)
avrddopti.menu.bootloaderusart.ser0_alt1.bootloader.port=_ser0_alt1
avrddopti.menu.bootloaderusart.ser0_alt1.bootloader.portname=Serial
avrddopti.menu.bootloaderusart.ser0_alt1.bootloader.portswap=1
avrddopti.menu.bootloaderusart.ser0_alt2=USART0 (alt2): TX PA2, RX PA3 (20+ pin only)
avrddopti.menu.bootloaderusart.ser0_alt2.bootloader.port=_ser0_alt2
avrddopti.menu.bootloaderusart.ser0_alt2.bootloader.portname=Serial
avrddopti.menu.bootloaderusart.ser0_alt2.bootloader.portswap=2
avrddopti.menu.bootloaderusart.ser0_alt3=USART0 (alt3): TX PD4, RX PD5
avrddopti.menu.bootloaderusart.ser0_alt3.bootloader.port=_ser0_alt3
avrddopti.menu.bootloaderusart.ser0_alt3.bootloader.portname=Serial
avrddopti.menu.bootloaderusart.ser0_alt3.bootloader.portswap=3
avrddopti.menu.bootloaderusart.ser0_alt4=USART0 (alt4): TX PC1, RX PC2
avrddopti.menu.bootloaderusart.ser0_alt4.bootloader.port=_ser0_alt4
avrddopti.menu.bootloaderusart.ser0_alt4.bootloader.portname=Serial
avrddopti.menu.bootloaderusart.ser0_alt4.bootloader.portswap=4
avrddopti.menu.bootloaderusart.ser1=USART1: TX PC0, RX PC1 (28/32 pin only)
avrddopti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrddopti.menu.bootloaderusart.ser1.bootloader.portname=Serial1
avrddopti.menu.bootloaderusart.ser1.bootloader.portswap=0
avrddopti.menu.bootloaderusart.ser1_alt2=USART1 (alt2): TX PD6, RX PD7
avrddopti.menu.bootloaderusart.ser1_alt2.bootloader.port=_ser1_alt2
avrddopti.menu.bootloaderusart.ser1_alt2.bootloader.portname=Serial1
avrddopti.menu.bootloaderusart.ser1_alt2.bootloader.portswap=2


##########################################################################
#                                                                        #
#   ###  #     # ####      #####   ###           ###          #          #
#  #   # #     # #   #     #      #   #         #   #        ###  ##     #
#  #####  #   #  ####  ### ####   #####         #   #  ###    #          #
#  #   #   # #   # #       #      #   #         #   #  #  #   #   ##     #
#  #   #    #    #  #      #####  #   #          ###   ###    #   ##     #
#______________________________________________________#_________________#
#                                        #             #
# We seriously don't know enough for     #
# this level of speculation.             #
#________________________________________#



########################################################################################################
#                                                                                                      #
#  ###       ####                                                    ####  ####      //  ####   ####   #
# #   # #### #   # #   #  #  #  #  ###      #  #  ##  #  #  ###      #   # #   #    //   #   #  #   #  #
# #####   #  #   # #   #  #  ## # #   #     ## # #  # ## # #   #     #   # ####    //    #   #  #   #  #
# #   #  #   #   # #   #  #  # ## #   #     # ## #### # ## #   #     #   # #   #  //     #   #  #   #  #
# #   # #### ####   ###   #  #  #  ###      #  # #  # #  #  ###      ####  ####  //      ####   ####   #
#______________________________________________________________________________________________________#
#                                         #
# As well as other Azduino boards with    #
# features that alter what things make    #
# sensible defaults, ex, the port serial  #
# uploads occur on, whether crystal pins  #
# need to be disabled even if not using   #
# crystal because it's still hardwired to #
# one which would be destroyed if they    #
# were set as outputs. If you've modified #
# the board to change that, then you      #
# should be using the generic DB/DD board #
#_________________________________________#
azduinoboard.build.board=InvalidBoard
azduinoboard.build.mvioenable=-DMVIO_ENABLED
azduinoboard.build.core=dxcore
azduinoboard.build.f_cpu={build.speed}000000L
azduinoboard.build.text_section_start=.text=0x200
azduinoboard.build.extra_flags=
azduinoboard.build.export_merged_output=true
azduinoboard.build.printf=
azduinoboard.build.attachmode=-DCORE_ATTACH_ALL
#-----------------------------------------#
# Bootloading parameters and fuses        #
#_________________________________________#
azduinoboard.bootloader.entrycond={bootloader.defaultentrycond}
azduinoboard.bootloader.defaulttimeout=
azduinoboard.bootloader.file={runtime.platform.path}/bootloaders/hex/{bootloader.class}{bootloader.port}_ser0_alt{bootloader.entrycond}{bootloader.timeout}.hex.
azduinoboard.bootloader.avrdudestring=-Uflash:w:{bootloader.file}:i
azduinoboard.bootloader.pymcuprogstring=-f "{bootloader.file}" -a write
azduinoboard.bootloader.tool=avrdude
azduinoboard.bootloader.WDTCFG=0x00
azduinoboard.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
azduinoboard.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
azduinoboard.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
azduinoboard.bootloader.CODESIZE=0x00
azduinoboard.bootloader.BOOTSIZE=0x01
#-----------------------------------------#
# Upload parameters for Optiboot          #
#_________________________________________#
azduinoboard.upload.tool=avrdude
azduinoboard.upload.protocol=arduino
azduinoboard.upload.extra_params=-D
azduinoboard.upload.speed=115200
azduinoboard.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
azduinoboard.build.mcupostfix=opti
azduinoboard.build.printfabr=
azduinoboard.build.attachabr=
azduinoboard.build.wireabr=
azduinoboard.build.appspmabr=

