SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
azduinoboard.menu.resetpin.reset=PF6: Reset (default boot entry on reset pin & SW resets, 1 sec timeout)
azduinoboard.menu.resetpin.reset.bootloader.defaultentrycond=_extr
azduinoboard.menu.resetpin.reset.bootloader.resetpinbits=10
azduinoboard.menu.resetpin.input=PF6: Input (default boot entry on power on & SW resets, 8 sec timeout)
azduinoboard.menu.resetpin.input.bootloader.defaultentrycond=_all_8sec
azduinoboard.menu.resetpin.input.bootloader.resetpinbits=00

#----------------------------------------#
# Optiboot Entry Conditions              #
#________________________________________#
azduinoboard.menu.entrycond.default=Default (reset pin and SW reset, 1 sec timeout - unless reset pin disabled, then POR and 8 sec timeout)
azduinoboard.menu.entrycond.extr=External (reset pin): Reset pin and SW reset, 1 second timeout (assume autoreset).
azduinoboard.menu.entrycond.extronly=External reset only: 1 second timeout (assume autoreset).
azduinoboard.menu.entrycond.all=Always: Every reset except a WDT reset, 8 second timeout - easy to enter bootloader
azduinoboard.menu.entrycond.poronly= Power On Only: Only when chip is powercycled, 8 second timeout (assume manual unplug)
azduinoboard.menu.entrycond.swr=SW-only: 8 second timeout (Warning: bad app code won't run the bootloader)
azduinoboard.menu.entrycond.extr_slow=External (reset pin), slow: Reset pin and SW reset, 8 second timeout (assume manual reset).
azduinoboard.menu.entrycond.default.bootloader.entrycond={bootloader.defaultentrycond}
azduinoboard.menu.entrycond.extr.bootloader.entrycond=_extr
azduinoboard.menu.entrycond.extronly.bootloader.entrycond=_extronly
azduinoboard.menu.entrycond.poronly.bootloader.entrycond=_poronly_8sec
azduinoboard.menu.entrycond.all.bootloader.entrycond=_all_8sec
azduinoboard.menu.entrycond.swr.bootloader.entrycond=_swronly_8sec
azduinoboard.menu.entrycond.extr_slow.bootloader.entrycond=_extr_8sec


#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
azduinoboard.menu.millis.tcb2=TCB2 (recommended)
azduinoboard.menu.millis.disabled=Disabled (delay() only)
azduinoboard.menu.millis.tcb0=TCB0
azduinoboard.menu.millis.tcb1=TCB1
azduinoboard.menu.millis.tcb3=TCB3 (48/64-pin parts only)
azduinoboard.menu.millis.tca0=TCA0
azduinoboard.menu.millis.tca1=TCA1 (48/64-pin parts only)
azduinoboard.menu.millis.tcb0.build.millistimer=B0
azduinoboard.menu.millis.tcb1.build.millistimer=B1
azduinoboard.menu.millis.tcb2.build.millistimer=B2
azduinoboard.menu.millis.tcb3.build.millistimer=B3
azduinoboard.menu.millis.tca0.build.millistimer=A0
azduinoboard.menu.millis.tca1.build.millistimer=A1
azduinoboard.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
azduinoboard.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
azduinoboard.menu.printf.full=Full, 2.6k, prints floats
azduinoboard.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
azduinoboard.menu.printf.full.build.printfabr=.pfF
azduinoboard.menu.printf.minimal=Minimal, 1.1k flash used
azduinoboard.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
azduinoboard.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
azduinoboard.menu.attach.allenabled=On all pins, with new implementation.
azduinoboard.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
azduinoboard.menu.attach.manual=Only enabled ports. Please see documentation.
azduinoboard.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
azduinoboard.menu.attach.oldversion=Old version, (may fix bugs)
azduinoboard.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
azduinoboard.menu.attach.manual.build.attachabr=.aMan
azduinoboard.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# MVIO menu                              #
#________________________________________#
azduinoboard.menu.mvioopti.enabled=Enabled
azduinoboard.menu.mvioopti.enabled.bootloader.mviobits=01
azduinoboard.menu.mvioopti.enabled.build.mvioenable=-DMVIO_ENABLED
azduinoboard.menu.mvioopti.disabled=Disabled
azduinoboard.menu.mvioopti.disabled.bootloader.mviobits=10
azduinoboard.menu.mvioopti.disabled.build.mvioenable=
azduinoboard.menu.mvioopti.reallyenabled=Enabled. Assume that "burn bootloader" has been performed with this option.
azduinoboard.menu.mvioopti.reallyenabled.bootloader.mviobits=01
azduinoboard.menu.mvioopti.reallyenabled.build.mvioenable==-DMVIO_ENABLED -DASSUME_MVIO_FUSE
azduinoboard.menu.mvioopti.reallydisabled=Disabled. Assume that "burn bootloader" has been performed with this option.
azduinoboard.menu.mvioopti.reallydisabled.bootloader.mviobits=10
azduinoboard.menu.mvioopti.reallydisabled.build.mvioenable=-DASSUME_MVIO_FUSE

#----------------------------------------#
# Startup time options                   #
#________________________________________#
azduinoboard.menu.startuptime.8=8ms
azduinoboard.menu.startuptime.0=0ms
azduinoboard.menu.startuptime.1=1ms
azduinoboard.menu.startuptime.2=2ms
azduinoboard.menu.startuptime.4=4ms
azduinoboard.menu.startuptime.16=16ms
azduinoboard.menu.startuptime.32=32ms
azduinoboard.menu.startuptime.64=64ms
azduinoboard.menu.startuptime.0.bootloader.sutbits=000
azduinoboard.menu.startuptime.1.bootloader.sutbits=001
azduinoboard.menu.startuptime.2.bootloader.sutbits=010
azduinoboard.menu.startuptime.4.bootloader.sutbits=011
azduinoboard.menu.startuptime.8.bootloader.sutbits=100
azduinoboard.menu.startuptime.16.bootloader.sutbits=101
azduinoboard.menu.startuptime.32.bootloader.sutbits=110
azduinoboard.menu.startuptime.64.bootloader.sutbits=111

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
azduinoboard.menu.wiremode.mors=1x Wire, Master or Slave (least Flash & RAM)
azduinoboard.menu.wiremode.mors.build.wiremode=MORS_SINGLE
azduinoboard.menu.wiremode.mors.build.wireabr=.wO
azduinoboard.menu.wiremode.mands=1x Wire, Master and Slave
azduinoboard.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
azduinoboard.menu.wiremode.mands.build.wireabr=.wA
azduinoboard.menu.wiremode.mors2=2x Wire, Master or Slave (not available on Nano DD)
azduinoboard.menu.wiremode.mors2.build.wiremode=MORS_BOTH
azduinoboard.menu.wiremode.mors2.build.wireabr=.wO2
azduinoboard.menu.wiremode.mands2=2x Wire, Master and Slave (not available on Nano DB)
azduinoboard.menu.wiremode.mands2.build.wiremode=MANDS_BOTH
azduinoboard.menu.wiremode.mands2.build.wireabr=.wA2
